Условие:
Создать класс ВitString для работы с битовыми строками длиной 64 бита.Битовая строка должна быть представлена двумя полями типа unsigned long.
Конструкторы инициализации должны обеспечивать инициализациюполей целыми числами любого типа и строкой типа string.Реализоватьтрадиционные операции для работы с битами(and, or , xor, not).
Для остальныхдействий реализовать перегруженные операции как методы класса.

Алгоритм решения:
Создать класс BitString с двумя полями типа unsigned long, которые будут представлять битовую строку длиной 64 бита
Создать конструкторы инициализации класса BitString, которые будут принимать целые числа любого типа и строку типа string для инициализации полей
Реализовать методы класса BitString, которые будут выполнять традиционные операции для работы с битами, такие как логическое И , логическое ИЛИ , исключающее ИЛИ , и отрицание.
Для остальных действий, которые требуется выполнить с битовой строкой, реализовать перегруженные операции как методы класса. Например, можно реализовать операции сложения , вычитания , сравнения и другие операции, которые могут быть полезны при работе с битовыми строками.
Протестировать функциональность класса BitString, создав объекты, выполняя операции с битовыми строками и проверяя результаты.

Запись:
https://drive.google.com/file/d/1nShDJuK0XOKbrfohQ4ZW6gulohL5sk4U/view?usp=sharing
